<template>
  <div class="review-detail">
    <div class="genres-wrapper" v-if="genres">
      <span class="genre" v-for="genre in genres" :key="genre">{{genre}}</span>
    </div>
    <div class="title-wrapper">
      <h3 class="title">{{review.title}}</h3>
    </div>
    <div class="user-wrapper" v-if="review.avatar">
      <img :src="review.avatar" alt="" class="user-avatar">
      <div class="user-content">
        <p class="user-name">{{review.userName}}</p>
        <p class="review-time">{{review.created_at}}</p>
      </div>
      <div class="thumb-up" @click.stop="clickHeart">
        <img class="heart" :src="heartUrl" alt="">
      </div>
    </div>
    <div class="content-wrapper">
      <p class="review-content">
        {{review.content}}
      </p>
    </div>
    <div class="footer-wrapper">
      <end-footer></end-footer>
    </div>
  </div>
</template>

<script type="text/ecmascript-6">
  import EndFooter from '../../components/end-footer.vue'

  const HOLLOW_HEART_URL = "../../../static/img/heart-hollow.png"
  const HEART_URL = "../../../static/img/heart.png"

  export default{
    data(){
      return {
        id: '',
        review: {
          avatar: '',
          userName: '',
          created_at: '',
          title: '',
          content: ''
        },
        genres: [],
        collected: false
      }
    },
    mounted(){
      let data = {
        "count": 20,
        "reviews": [
          {
            "rating": {
              "max": 5,
              "value": 3,
              "min": 0
            },
            "useful_count": 39,
            "author": {
              "uid": "177909948",
              "avatar": "https://img3.doubanio.com/icon/u177909948-4.jpg",
              "signature": "",
              "alt": "https://www.douban.com/people/177909948/",
              "id": "177909948",
              "name": "发呆中的电冰箱"
            },
            "created_at": "2018-05-29 18:13:02",
            "title": "珍惜眼前人 不要等失去了是覅哦理解圣诞节可怕苏东坡付过款",
            "updated_at": "2018-05-29 18:13:02",
            "share_url": "https://m.douban.com/movie/review/9401920",
            "summary": "一部反映大学校园校花校草的爱情故事，故事太过简单，人物刻画得不够细致 。剧情推进不错，老梗玩得不少，前面加了一些色情的东西，估计是为了吸引人看，后面就比较感人了，情节虽然老套，但主题仍旧是能与过去的...",
            "content": "一部反映大学校园校花校草的爱情故事，故事太过简单，人物刻画得不够细致\n。剧情推进不错，老梗玩得不少，前面加了一些色情的东西，估计是为了吸引人看，后面就比较感人了，情节虽然老套，但主题仍旧是能与过去的自己连接，意图改变当时的自己，最后一幕让人感觉有续作或者是承接此剧后，珍惜眼前人，不要等失去了才去后悔，不要等到最后只能唱一首往事只能回味，总体感官不错。",
            "useless_count": 0,
            "comments_count": 0,
            "alt": "https://movie.douban.com/review/9401920/",
            "id": "9401920",
            "subject_id": "26931155"
          },
          {
            "rating": {
              "max": 5,
              "value": 3,
              "min": 0
            },
            "useful_count": 25,
            "author": {
              "uid": "155625908",
              "avatar": "https://img3.doubanio.com/icon/u155625908-1.jpg",
              "signature": "",
              "alt": "https://www.douban.com/people/155625908/",
              "id": "155625908",
              "name": "萧萧是个乖孩子"
            },
            "created_at": "2018-05-29 15:10:51",
            "title": "最重要的还是珍惜当下，不留遗憾",
            "updated_at": "2018-05-29 15:10:51",
            "share_url": "https://m.douban.com/movie/review/9401591",
            "summary": "一部小清新的爱情文艺片，虽然讲述的是传统的校园爱情，但是电影里的情节无一不带给我们校园的回忆。男女主角“冤家”式的爱情，阳艺雪在爱情和友情上的犹豫，男配对女主舍友的求爱，舍友之间的互损，衣服长时间...",
            "content": "一部小清新的爱情文艺片，虽然讲述的是传统的校园爱情，但是电影里的情节无一不带给我们校园的回忆。男女主角“冤家”式的爱情，阳艺雪在爱情和友情上的犹豫，男配对女主舍友的求爱，舍友之间的互损，衣服长时间不洗还换水，在宿舍吃火锅，这些情节都曾经发生在我们的身边，真实而温暖。这部电影带我重新体验了一回大学生活。年轻的我们有过欢笑、有过泪水，有过坚定不移，也有过迷茫，甚至是充满激情、敢爱敢恨，让校园生活充满了回忆。电影中阳艺雪用“月光宝盒”挽救自己和莫晓枫的爱情，以及自己和李芊的友情，而现实生活中我们没有这样的“月光宝盒”，所以为了不给自己的人生留下遗憾，只有更加珍惜眼前人。",
            "useless_count": 0,
            "comments_count": 0,
            "alt": "https://movie.douban.com/review/9401591/",
            "id": "9401591",
            "subject_id": "26931155"
          },
          {
            "rating": {
              "max": 5,
              "value": 3,
              "min": 0
            },
            "useful_count": 37,
            "author": {
              "uid": "157745144",
              "avatar": "https://img3.doubanio.com/icon/u157745144-5.jpg",
              "signature": "",
              "alt": "https://www.douban.com/people/157745144/",
              "id": "157745144",
              "name": "蝶衣"
            },
            "created_at": "2018-05-29 20:12:46",
            "title": "错过的爱情，循环往复的遗憾",
            "updated_at": "2018-05-29 20:12:46",
            "share_url": "https://m.douban.com/movie/review/9402102",
            "summary": "“如果我当时勇敢，回忆是不是也可以改变。”十年之后，阳艺雪因错过爱情而后悔。在发现莫晓枫留给自己的木盒可与过去时空连接时，29岁的阳艺雪试图挽回昔日的爱人。她根据日记里记录下的与莫晓枫相处的时时刻刻...",
            "content": "“如果我当时勇敢，回忆是不是也可以改变。”十年之后，阳艺雪因错过爱情而后悔。在发现莫晓枫留给自己的木盒可与过去时空连接时，29岁的阳艺雪试图挽回昔日的爱人。她根据日记里记录下的与莫晓枫相处的时时刻刻，不停地跑到两人曾经待过的场所，通过不断地与19岁的自己鸿雁传书，来欲追回错失的爱。画面随着女主的视角在过去与现在两者间游走。往昔的大学生活是如此美好、单纯，如今的都市生活则是如此忙碌、痛苦。两者形成鲜明的对照。\r\n片中戳点台词和养眼画面互补叠加，流畅亲切，易于消化。故事虽有怀旧色彩，但绝不是古早味的清汤寡水，而是让你从舌尖烧到胃袋的高粱酒，而且在展现浪漫的小美好上极其细腻，搞笑内容则用料很猛。那所谓的“信件穿越”，只是回忆的透镜而已，将过去的时光投射到今时的天花板上。叫人见到大学时代的青涩之爱。莫晓枫与阳艺雪的相处点滴，不仅有着很多诙谐幽默的笑料，还有不少情意浓浓的浪漫细节，直线击中了最率真矜持的纯情。女主的挽爱行动，无法让男主最终摆脱死亡的命运，但爱情的遗憾却得到了弥补，这让结局充满了暖意。其实，阳艺雪弥补错过的爱情过程，只不过是折射她心中美好的愿望罢了，变相地显示此情可待成追忆。对于逝去的青春，不管你若无悔还是无悔，我们除了感谢经过的事、遇到的人，还能多说些什么。有多少爱可以重来，有多少人值得等待。爱情对于很多人来说，就是这样一道循环往复的符咒而已。",
            "useless_count": 0,
            "comments_count": 0,
            "alt": "https://movie.douban.com/review/9402102/",
            "id": "9402102",
            "subject_id": "26931155"
          },
          {
            "rating": {
              "max": 5,
              "value": 3,
              "min": 0
            },
            "useful_count": 16,
            "author": {
              "uid": "161571135",
              "avatar": "https://img3.doubanio.com/icon/u161571135-1.jpg",
              "signature": "",
              "alt": "https://www.douban.com/people/161571135/",
              "id": "161571135",
              "name": "芳香"
            },
            "created_at": "2018-05-29 20:58:30",
            "title": "珍惜身边的人，珍惜时光！",
            "updated_at": "2018-05-29 20:58:30",
            "share_url": "https://m.douban.com/movie/review/9402196",
            "summary": "一部小清新的爱情文艺片这部电影写得是青春时期的爱情的不勇敢，造成的遗憾，但是通过这种时光穿梭的方式让时光倒流做了不一样的选择，然后不同的未来，寓意都是珍惜身边的人，珍惜时光！情节老套主题仍旧是能与...",
            "content": "一部小清新的爱情文艺片这部电影写得是青春时期的爱情的不勇敢，造成的遗憾，但是通过这种时光穿梭的方式让时光倒流做了不一样的选择，然后不同的未来，寓意都是珍惜身边的人，珍惜时光！情节老套主题仍旧是能与过去的自己连接，意图改变当时的自己，但如果只能改变过去的经历，却改变不了结局呢？而这个似乎有着自己的解读，只要共同经历，一切不重要！",
            "useless_count": 0,
            "comments_count": 0,
            "alt": "https://movie.douban.com/review/9402196/",
            "id": "9402196",
            "subject_id": "26931155"
          },
          {
            "rating": {
              "max": 5,
              "value": 3,
              "min": 0
            },
            "useful_count": 10,
            "author": {
              "uid": "148403852",
              "avatar": "https://img3.doubanio.com/icon/u148403852-10.jpg",
              "signature": "",
              "alt": "https://www.douban.com/people/148403852/",
              "id": "148403852",
              "name": "ʕ•̫͡•ིʔྀʕ•̫͡•ིʔ"
            },
            "created_at": "2018-05-29 11:05:29",
            "title": "抓住现在",
            "updated_at": "2018-05-29 13:37:36",
            "share_url": "https://m.douban.com/movie/review/9401169",
            "summary": "人生是一列前行的列车，只有单程票，抓住现在，活在当下，也许这也是导演想要传达给我们的东西。 这部有点类似与解忧，做了趟哆啦A梦的时光机，回到过去弥补了青春的遗憾，但是结果是注定的了，只是过程变化了，...",
            "content": "人生是一列前行的列车，只有单程票，抓住现在，活在当下，也许这也是导演想要传达给我们的东西。 这部有点类似与解忧，做了趟哆啦A梦的时光机，回到过去弥补了青春的遗憾，但是结果是注定的了，只是过程变化了，变得让人可以接受了。希望青春不留白，勇敢爱。关于爱情，关于勇敢，如果你能回到19岁你会勇敢的说出“我爱你”吗？ ",
            "useless_count": 0,
            "comments_count": 2,
            "alt": "https://movie.douban.com/review/9401169/",
            "id": "9401169",
            "subject_id": "26931155"
          },
          {
            "rating": {
              "max": 5,
              "value": 3,
              "min": 0
            },
            "useful_count": 12,
            "author": {
              "uid": "137045305",
              "avatar": "https://img3.doubanio.com/icon/u137045305-1.jpg",
              "signature": "",
              "alt": "https://www.douban.com/people/137045305/",
              "id": "137045305",
              "name": "米果"
            },
            "created_at": "2018-05-29 11:00:18",
            "title": "慰藉心灵的后悔药",
            "updated_at": "2018-05-29 20:04:51",
            "share_url": "https://m.douban.com/movie/review/9401157",
            "summary": "这是一部集所有美好于一体的爱情片。首先，29岁的阳艺雪通过和19岁的自己对话，改变了青春时期的友谊和爱情，因为青春已经经历过一次，所以如果能重来，必然会更加顺遂自己的心愿；再者，莫晓枫的人设简直是所有...",
            "content": "这是一部集所有美好于一体的爱情片。首先，29岁的阳艺雪通过和19岁的自己对话，改变了青春时期的友谊和爱情，因为青春已经经历过一次，所以如果能重来，必然会更加顺遂自己的心愿；再者，莫晓枫的人设简直是所有少女的理想对象，人帅得掉渣，弹得溜吉他，玩得转浪漫，可以毫不正经的追爱，也可以一本正经的撩妹，而阳艺雪，不管是29岁还是19岁，都有这么一个对她死心塌地、甘愿付出的男友，这样的男女主人物设定，必然暖化并俘虏了全龄女性观众；再有，虽然不管是哪一种结局，莫晓枫都没有逃脱死亡的命运，但其过程的精彩程度早已让人忘记了终局的忧伤，而是跟着那个“神秘的盒子”将思绪带回到了自己的过去。荷尔蒙和多巴胺的化学反应，让这段真爱有了结果，让两人的青春有了遗憾，所有的“后悔药”都不过是一种在现实中无法实现的寄托。正如霸道总裁题材的小说和影视剧总能无理由的收获好多粉丝一样，越是在生活中不可能完成的事，越是容易在电影中找到共鸣。\n人生能有多少个十年？不要求自己走出的每一步都是对的，但求自己走出的每一步都是无悔的。活好当下，用当下的心态和心境做出最大化让自己满意的抉择。其实，无论是19岁还是29岁，都不是特定的年龄，而是说，弹指一挥间的过去和每一个生活着的现在；不论是莫晓枫还是阳艺雪，还是曾经青春年少过的我们，都没有任何理由大肆放纵情感上的小任性，毕竟，现实生活中没有“神秘盒子”为我们未来的懊悔来买单，那些所谓的“遗憾”也并没有任何方式可以重来或弥补，也正是因为如此，《给19岁的我自己》才会在爱情片中脱颖而出，显得那么与众不同，看着别人的爱情故事，来回忆自己的青春，去解放和释怀那些我们曾经的不够勇敢和不够执着。",
            "useless_count": 1,
            "comments_count": 1,
            "alt": "https://movie.douban.com/review/9401157/",
            "id": "9401157",
            "subject_id": "26931155"
          },
          {
            "rating": {
              "max": 5,
              "value": 3,
              "min": 0
            },
            "useful_count": 1,
            "author": {
              "uid": "50608353",
              "avatar": "https://img1.doubanio.com/icon/u50608353-8.jpg",
              "signature": "普罗旺斯的约定！",
              "alt": "https://www.douban.com/people/50608353/",
              "id": "50608353",
              "name": "Echo"
            },
            "created_at": "2018-05-26 01:03:17",
            "title": "一篇并不正经的影评",
            "updated_at": "2018-05-29 20:10:21",
            "share_url": "https://m.douban.com/movie/review/9393952",
            "summary": "其实说起来应该三星半，但个人认为还没到四星，franchement … 一切青春片应该有的元素都有了，也没有大陆青春片桥段那些狗血桥段。看电影的时候迟到了两分钟，一进场男主就挂了😅一脸懵逼之时才发现原来是一部...",
            "content": "其实说起来应该三星半，但个人认为还没到四星，franchement …\r\n一切青春片应该有的元素都有了，也没有大陆青春片桥段那些狗血桥段。看电影的时候迟到了两分钟，一进场男主就挂了😅一脸懵逼之时才发现原来是一部超现实青春片🤣女主通过盒子写信的设定莫名回想起解忧杂货店和哆啦A梦。可能每个人都有幻想过若能同过去的自己沟通，那要说些什么吧……\r\n不过，虽然具有了一切青春片的元素，剧情稍显老套😅什么校花室友和女主同喜欢一个人、女主勇气不够、然后女主被整蛊之类…的……\r\n女主开场对着男主遗留下的99封信开始哭，那一段稍显用力过猛（后来交流的时候导演说女主第一次拍这场哭戏的时候还没有和对手方林伯宏见过面，后来重新酝酿了感情又拍了一次，还是非常认真的！但也要注意方式方法，比如如果把这场戏放后面拍就会自然的多以及不用走弯路？作为业余观影人员的一点浅见……）；然后觉得女主演19岁的戏份比成熟后29岁的戏份要自然得多，个人还是很喜欢里面安妮小姐姐的，希望继续加油！\r\n林伯宏演技果然要成熟得多，流畅度很高。但是开头学长的痞帅设定，老实说有一点low，什么漏点、偷看女生洗澡之类…可能导演想刻画大学里的男生就是这样（可能很多也真是这样…），但是个人不太喜欢这种设定。还好后来的表现完全救场了。好几场戏，包括麦当劳偷吃薯条、木乃伊旁边的偷亲和学校便利店里的邪魅一笑（？？就是很想用这样一个神奇的词语🤣）看得人少女心贲张！还有一场特别喜欢的戏是摄影展上男主喝退女二，太正了有没有！明辨是非不为绿tea所动！坚决护犊子！这样的男主真是风清气正！🤣\r\n以上勉强算影评部分混杂了一些个人的blabla😂总之观影后交流会的感觉导演实在是很可爱啊！把自己曾经不敢干的事情写进影片里之类的。不知道让女主获得时光盒子改变自己改变随后的生命轨迹这个设定中是不是也有导演曾经的遗憾或者说青春的影子在呢？后来把女二的命运扭转了，带来happy ending，我倒不觉得是强行大团圆，倒觉得是因为导演一定希望这是一个美好的世界🌱\r\n不过，虽然说女主的设定有一点老套，但是很多人可能在她身上能找到自己的影子。（笔者）在现实生活中也是这样一个人（不要攻击我），看到想要的东西、xihuanderen可能没那么有勇气说出来，因此看着女主就仿佛另一个平行时空的自己，希望那个世界的自己能升级打怪所向披靡吧！但让我真的像女主那样拿到一个盒子，也未必会像女主那样。一直觉得，当下做出的决定是纠结了多方因素的一个认知的结果，当下的条件下我就是做了这样的一个决定，因为种种方面都是不成熟的，再回到那时候，很多条件可能还是没有改变，所以也没什么好后悔。悟以往之不谏，知来者之可追。人总是不断成长，希望未来能够走出这个圈吧。也许将来30岁的我面对这个问题，想法就不一样了😁\r\n最后为男二惋惜一下……这样的人真的只有在作品里才出现吧！现在的人太急躁了，谁会这样地等一个人呢？（最近有些负面）而且果然世界线改变了他就不见了…哎……\r\nP.S. 其实我是为了苑琼丹老师去的，然而她只出现了三分钟呜呜😅\r\n最后的最后的最后，感谢豆瓣组织这场观影活动！电影同款巧克力的设计简直太6了！",
            "useless_count": 0,
            "comments_count": 1,
            "alt": "https://movie.douban.com/review/9393952/",
            "id": "9393952",
            "subject_id": "26931155"
          },
          {
            "rating": {
              "max": 5,
              "value": 3,
              "min": 0
            },
            "useful_count": 8,
            "author": {
              "uid": "173320183",
              "avatar": "https://img3.doubanio.com/icon/u173320183-3.jpg",
              "signature": "",
              "alt": "https://www.douban.com/people/173320183/",
              "id": "173320183",
              "name": "爱吃猫的鱼🐠"
            },
            "created_at": "2018-05-29 22:10:52",
            "title": "似水流年",
            "updated_at": "2018-05-29 22:10:52",
            "share_url": "https://m.douban.com/movie/review/9402352",
            "summary": "这种青春片采用穿越时空，回归校园时代的梗倒也很常见，所以说影片整体平平，没有什么太大的惊喜。但是影片出现频率最高的一句台词“不好好学习没关系，泡学长才是正经事”，倒是给我留下深刻印象。我们现在的学...",
            "content": "这种青春片采用穿越时空，回归校园时代的梗倒也很常见，所以说影片整体平平，没有什么太大的惊喜。但是影片出现频率最高的一句台词“不好好学习没关系，泡学长才是正经事”，倒是给我留下深刻印象。我们现在的学生都被要求要好好学习，天天向上，但是是否又有很多人追忆过自己的青春，“我学好了吗，我们在本该释放天性的大好年华选择学习，值得吗，我们对的起自己的青春吗，对的起自己吗？我们又在大好年华错过了多少人多少事？”如果给你一次回到青春的机会，你又会怎样为自己选择人生轨道，，你又是否会有勇气去挽回那些人那些事呢？但是青春总会有遗憾，青春就像那些风吹花落的瞬间，总让我们不经意的感慨，流年，原来就真的流走了，而宿命却铺天盖地而来原来，那些关于青春的记忆已经淡的如一片粉红色花瓣。我们终究淹没于宿命中，流离失所，或者轰轰烈烈。有那样一个背影，如花美眷，似水流年，美好只是美好，眷恋，只是眷恋！",
            "useless_count": 0,
            "comments_count": 0,
            "alt": "https://movie.douban.com/review/9402352/",
            "id": "9402352",
            "subject_id": "26931155"
          },
          {
            "rating": {
              "max": 5,
              "value": 3,
              "min": 0
            },
            "useful_count": 0,
            "author": {
              "uid": "153556899",
              "avatar": "https://img1.doubanio.com/icon/u153556899-8.jpg",
              "signature": "",
              "alt": "https://www.douban.com/people/153556899/",
              "id": "153556899",
              "name": "安若晴"
            },
            "created_at": "2018-05-29 21:58:22",
            "title": "16岁是花季，17岁是雨季，18岁雾季，那么19岁是？",
            "updated_at": "2018-05-29 21:58:34",
            "share_url": "https://m.douban.com/movie/review/9402319",
            "summary": "19岁的我自己，有时突然想起，发现自己好像忘记了，虽然有悸动，但那是对自己的感动，与别人无关了。19岁的我们憧憬未来，29岁的我们却回忆当初，明明只隔着10年啊，也许每个人心里都有一根拔不掉的刺。 往往让人...",
            "content": "19岁的我自己，有时突然想起，发现自己好像忘记了，虽然有悸动，但那是对自己的感动，与别人无关了。19岁的我们憧憬未来，29岁的我们却回忆当初，明明只隔着10年啊，也许每个人心里都有一根拔不掉的刺。 往往让人没有那么期待的东西 会给你意外的惊喜 未满20 刚好19 你没有办法像29岁的阳艺雪那样重活一次19岁乃至之后的人生 但还好你恰好还在19岁 你只需告诉自己 勇敢些 再勇敢些 ！\n最喜欢主角的一句话：好的梦想不该被遗忘与其懊悔过去，不如珍惜现在 . 面对现实，我们只能喜欢就表白，勇敢去说爱。不管两个人是否能天长地久，至少，不让青春留有遗憾。虽然回不到十九岁，但仍然要相信爱，努力过不后悔。 \r\n",
            "useless_count": 0,
            "comments_count": 0,
            "alt": "https://movie.douban.com/review/9402319/",
            "id": "9402319",
            "subject_id": "26931155"
          },
          {
            "rating": {
              "max": 5,
              "value": 4,
              "min": 0
            },
            "useful_count": 2,
            "author": {
              "uid": "161017884",
              "avatar": "https://img3.doubanio.com/icon/u161017884-6.jpg",
              "signature": "",
              "alt": "https://www.douban.com/people/161017884/",
              "id": "161017884",
              "name": "媸"
            },
            "created_at": "2018-05-29 21:07:18",
            "title": "我想跟19岁错过的那个人讲，不如我们重新来过",
            "updated_at": "2018-05-29 21:56:31",
            "share_url": "https://m.douban.com/movie/review/9402217",
            "summary": "在连续加了一个月的某一天，放松一下自己，奖励自己去看个电影。正好看到影院上线这部电影，奔着名字去看了。 整个电影院只有我和前排不认识的一位也是独自去看电影的人。也算是包场吧。 电影放到半个小时的时候...",
            "content": "在连续加了一个月的某一天，放松一下自己，奖励自己去看个电影。正好看到影院上线这部电影，奔着名字去看了。\r\n整个电影院只有我和前排不认识的一位也是独自去看电影的人。也算是包场吧。\r\n电影放到半个小时的时候我甚至在想为什么要浪费时间看这个片子。充斥着狗血又老套的句子，感觉像是为了凑时长硬加上去的旁白。看着男主的酒窝，还是决定坚持，毕竟爱酒窝癌晚期。\r\n看到女主跟现男友在一起却想着前男友时觉得这简直太婊了。特别是看到女主对现男友讲说，让我最后任性一次好吗。简直不能接受这个人设。一边在心里嘲讽默默吐槽一边继续观影。\r\n然而看着看着就突然感动于这部电影，甚至随着剧情露出花痴笑。划重点————————\r\n为什么我一个单身狗总是要一个人去看这样虐狗的电影！！！\r\n最后半小时比较精彩，女主尾随男主。在超市里，悄悄的在货架后看男主一眼然后被发现，男主对女主笑起来，深深的酒窝。多么像我们的青春岁月，偷偷跟着喜欢的人，相视一笑。一切美丽的事情好像就定格在那一瞬间。\r\n天台表白放烟花那一幕很经典。我想我是女主的话要被感动死。然后回忆自己的青春岁月，会感叹于自己的19岁里没有收到过这样子浪漫的事情。\r\n还记得高一时，初入校园。被班级一个男生拉到操场，人生中第一次被男生牵手告白。堂皇的心情大过于感动，当时只觉得莫名其妙。因为这场告白，还被喜欢这个男孩子的女生背后说坏话。当时觉得很无解，现在回想觉得很好笑。时间越过越久，很多事情都会拼凑成美好的回忆吧。\r\n最后男主还是得肺癌死掉，也许有些事情改变了过程，但结局并不会改变吧。最后，女主之前的现男友买了可以写给过去的盒子，也许一个新的故事会发生吧。\r\n最后，放上几张拍的很失败的剧照。",
            "useless_count": 0,
            "comments_count": 1,
            "alt": "https://movie.douban.com/review/9402217/",
            "id": "9402217",
            "subject_id": "26931155"
          },
          {
            "rating": {
              "max": 5,
              "value": 2,
              "min": 0
            },
            "useful_count": 0,
            "author": {
              "uid": "176351944",
              "avatar": "https://img1.doubanio.com/icon/user_normal.jpg",
              "signature": "",
              "alt": "https://www.douban.com/people/176351944/",
              "id": "176351944",
              "name": "希希 爱电影"
            },
            "created_at": "2018-05-29 17:47:08",
            "title": "《给19岁的我自己》——论跨越十年的狗血虐恋",
            "updated_at": "2018-05-29 17:47:08",
            "share_url": "https://m.douban.com/movie/review/9401876",
            "summary": "跨越10年之久的虐心之恋，已经结婚成家的阳艺雪对大学初恋莫晓枫久久不能释怀。当得知初恋莫晓枫意外逝去，悲痛欲绝的阳艺雪抛开现有的家庭和生活，借助初恋留下的宝盒穿越回十年前，找回那段业已远去的大学初恋...",
            "content": "跨越10年之久的虐心之恋，已经结婚成家的阳艺雪对大学初恋莫晓枫久久不能释怀。当得知初恋莫晓枫意外逝去，悲痛欲绝的阳艺雪抛开现有的家庭和生活，借助初恋留下的宝盒穿越回十年前，找回那段业已远去的大学初恋。\r\n为了找回失去的莫晓枫，阳艺雪意外发现眼泪可以触动宝盒穿越回从前。翻出十年前的日记，手捧宝盒带着书信，莫晓枫回到日记中记载的地点和相同月日分秒，找回失去的另一半。\r\n大学时阳艺雪是一名历史系本科生，莫晓枫攻读摄影系。因为男生宿舍的意外事故，搬到女生宿舍借住的莫晓枫和室友偶遇阳艺雪和暗恋晓枫已久的李芊。之后莫晓枫等人起了色心，偷窥女生澡堂，被阳艺雪抓个正着。阳艺雪被莫晓枫迷人帅气的眼神所征服。之后一直忘不掉晓枫帅气伟岸的身姿。在宿舍楼天台晾晒衣服的艺雪经常碰见弹吉他或者拍照的晓枫，聊聊闹闹成了很好的朋友。\r\n莫晓枫也惦记着艺雪，偷看艺雪上实验课，艺雪看见头骨模型总想起晓枫的模样，心神不宁。晓枫请艺雪来酒吧过生日。公开宣称晓枫是自己男友的李芊颇为吃醋。酒后二人大醉，搀扶着回宿舍。\r\n光棍节，莫晓枫约阳艺雪在一家麦当劳情侣餐，准备庆祝脱离光棍生活。李芊赶来撞见阳艺雪。艺雪不想伤闺蜜匆匆离去，李芊和莫晓枫约谈，晓枫拒绝了李芊的感情。回到操场，人们在庆祝成功脱光，莫晓枫和阳艺雪也在庆祝二人世界。李芊看在眼里，恨在心头。\r\n一天晚上阳艺雪做实验到很晚，楼道大门不知被谁锁住。久等不见人影的晓枫跳窗户救出艺雪，没被保安追上，但被监控拍到。学校调查此事，恰好李芊看见监控器里二人亲热的视频，气忿离去。\r\n第二天学校冒出来很多大字报，声讨阳艺雪小三，莫晓枫极力维护艺雪，同学们纷纷调查猜测始作俑者。\r\n莫晓枫拍了许多艺雪的照片，准备合集办画展，力邀阳艺雪参观展览。不想当天李芊闯入会场大闹，被愤愤不平的众人揭发买通维修工破坏男生宿舍下水道，还有深夜贴大字报等罪证。晓枫怒斥李芊。事发后没脸见人的李芊搬离学校去外面住。阳艺雪对好朋友的离去十分自责伤心。\r\n李芊使出最后一招跳楼，威胁莫晓枫承认二人关系，不想滑落楼下摔伤致残。阳艺雪更加内疚，不忍看到朋友这一幕。过一段时间同莫晓枫分手，大学初恋就此结束。但莫晓枫心里一直有阳艺雪，多年来念念不忘，一直写信给她。阳艺雪也忘不了莫晓枫，多年后有了家庭依然对晓枫惦念不忘。直到莫晓枫意外离世，二人也没有迈出复合的一步。\r\n晓枫的猝逝极大刺激了艺雪的身心，她意识到现在老公再好的疼爱也无法比拟初恋曾经给予她的感情。艺雪决定写信通过时光宝盒递给十年前的自己和相关的人，改变当年的决定，重写她和晓枫的爱情。\r\n信写给当年的艺雪，教她自己翻窗离开实验室去找晓枫，生活中不要总踹到晓枫的下体。也劝说李芊同艺雪和好，避免跳楼惨剧。少了打搅和犹豫彷徨，每封信产生的改变真就使得莫晓枫和阳艺雪经历一次次浪漫约会，成为天造地设的一对夫妻。在穿越和改变中，艺雪毫不犹豫的抛弃了深爱也理解她心情的老公子喻，和莫晓枫过起幸福生活，也有了宝宝。多年后莫晓枫因肺癌逝世，葬礼上也不失亲戚朋友对晓峰的哀思和对艺雪母子的祝福。\r\n时光在变，曾经坚固不可摧垮的教学楼在拆迁中化作废墟，但阳艺雪和莫晓枫的初恋之爱是永恒的。幸福是珍惜在一起的时候。\r\n \r\n哈哈哈哈，拉片写到这儿已经笑喷了。真是个毁三观的狗血爱情故事。\r\n难以想象过去了十年，已经嫁人成家的阳映雪，不顾深爱自己的丈夫，深深迷恋着初恋男友，不惜给丈夫戴上绿帽子，在丈夫耳边不时叮咛思念当年初恋男友有多么多么好。得知初恋男友死讯竟悲痛得不能自已，一定要找回当年的初恋。丈夫子喻被妻子戴了这么多年绿帽子，竟也是对妻子的想法宽容大度，帮妻子一起去寻觅初恋。最终成功帮妻子找回初恋，和初恋成家生活。三观碎了一地，这真是一对高水平的备胎男和劈腿女夫妻。\r\n阳映雪对初恋莫晓枫的思念已经陷入变态的痴狂，为了去爱不明所以爱到发疯，不顾丈夫和家庭去爱一个已经逝去的人。为了追回逝去的初恋抛下丈夫，穿越时空拯救爱情，不得不说是失心疯到无可救药的程度。\r\n阳映雪和莫晓枫的邂逅相逢来的不可思议。先是楼上天花板塌了不得已搬宿舍，楼道里撞见穿着运动胸衣短裙的阳映雪。后有色狼澡堂外偷窥被抓现行成邂逅。正常人思维，偷窥女生洗澡的色狼变态没被勇敢的女生暴打去势再扭送保卫科开除学籍就不错了，居然和被偷窥的女生处上对象。这样的女生也太作践自己吧。上次看到类似场景是在国产片《时间都去哪了》里面男生宿舍用望远镜偷窥女生宿舍的一幕。真是要笑喷，编剧导演的思想怎么这么污？真佩服人家充满欲望的无限想象力。\r\n阳映雪应该是有多层次性格层面的女生，影片写得她一傻到底为爱痴狂，没有映雪其他层面上性格的体现。莫晓枫一脸色眯眯，好在有摄影的魅力为他追映雪增点光。\r\n女二号李芊是个病态的单相思病患者，莫晓枫根本没有爱过她，她却疯狂的迷恋莫晓枫，借机总在宣扬自己是莫晓枫的女友。同时李芊是个极度嫉妒病患者，看不得幻想中爱着她的莫晓枫有了真正的心上人，终于心理变态四处贬损阳映雪。阳映雪此时的反应诡异，无限宽容李芊的举动，为这样一个室友的举动伤了友谊而伤心自责，为李芊作死的跳楼深深自责。后来穿越过去救回这个深深伤害过自己的李芊，又成闺蜜。这样一个阳映雪性格太柔弱没原则，没底线也没自尊，当断不断反受其乱。\r\n影片大胆启用新人。男主莫晓枫和他的室友太社会人，年龄也显老，咋看也不像大学生。偷窥女生洗澡被抓现行后和阳映雪对视的眼神咋看都像色狼老流氓，街头小混混，哪有大学生的样子。阳映雪的眼神像是懵懵懂懂的小迷妹，看见一男人不知所措，之前抓现行踢裆打色狼的勇敢全无。后面俩人的对视，莫晓枫总是色眯眯的一双眼，一脸勾搭女生的坏笑，阳映雪总是在迷这么一个男主。不过倒是符合二人分手后阳映雪对莫晓枫长达十年的虐心痴恋终是不悔。\r\n饰演李芊的演员台词不过关，普通话说不标准，台词一个一个字往外蹦，表情神态也不到位。一个病态痴恋男主的极度嫉妒女，面对真实女友的回应不够理直气壮，显得气场不足。当自己的恶行被人戳穿，人崩溃前的内心戏不够强，连强撑气场的底气都没，僵硬僵硬的演。\r\n跨越十年的病态痴情虐恋，大学色狼爱上傻白甜迷妹的狗血剧情。\r\n\r\n",
            "useless_count": 0,
            "comments_count": 0,
            "alt": "https://movie.douban.com/review/9401876/",
            "id": "9401876",
            "subject_id": "26931155"
          },
          {
            "rating": {
              "max": 5,
              "value": 2,
              "min": 0
            },
            "useful_count": 1,
            "author": {
              "uid": "bingshu0329",
              "avatar": "https://img3.doubanio.com/icon/u4124110-2.jpg",
              "signature": "金如玉",
              "alt": "https://www.douban.com/people/bingshu0329/",
              "id": "4124110",
              "name": "炳叔"
            },
            "created_at": "2018-05-29 15:19:45",
            "title": "给19岁的我自己：放不下，爱不起",
            "updated_at": "2018-05-29 15:19:45",
            "share_url": "https://m.douban.com/movie/review/9401614",
            "summary": "好戏，筋、骨、皮、肉、相。 这戏，看筋。 没有放不下的忧伤； 只有爱不起的回忆。 电影《给19岁的我自己》的筋，连着一本书的骨， 书是@写字的阿琪 《爱得起放得下》 男主角，一根筋。 孤独十年，徒步十年，相思...",
            "content": "好戏，筋、骨、皮、肉、相。\r\n这戏，看筋。\r\n没有放不下的忧伤；\r\n只有爱不起的回忆。\t\r\n电影《给19岁的我自己》的筋，连着一本书的骨，\r\n书是@写字的阿琪 《爱得起放得下》\r\n\r\n\r\n男主角，一根筋。\r\n孤独十年，徒步十年，相思十年，写信十年。\r\n信是一封一封从未邮寄的、手写的倾诉。\r\n终于，死前，修得一个禅机。\r\n他最爱的人，得到了一个宝盒，是一个能够穿越时空的信箱，《解忧杂货铺》同款，能给十九年前的自己写信。\r\n女主角，一根筋。\r\n守诺十年，悔恨十年，相思十年，不见十年。\r\n她19岁那年，被自己同宿舍的校花闺蜜，全面掠夺了自尊、自信和男朋友。\r\n就算是在29岁的自己，利用穿越宝盒写信的作弊提示下，\r\n依然，向自己的闺蜜发誓，永远放弃自己的爱情，永不背叛友谊。\r\n结果，闺蜜自杀秀玩砸了坠楼终生残废，成了横亘在她和他之间的罪与罚。\r\n老天爷，一根筋。\r\n给了后悔药作弊器，就随你折腾。\r\n利用报纸传信，泄露房价重大历史机密，可以。\r\n闺蜜情深，同宿舍的都共享未来，一起总裁、发财、豪宅、名车成功知识女性，无人受伤害，大家都美满，也没问题。\r\n但是，\r\n男主角，运可以改，命不能变。\r\n19到29岁，你改他十年的运，陪他热恋结婚生子，OK。\r\n我到点，还是取他的命。\r\n肺癌。\r\n另外，\r\n别忘了，29岁的你还欠另一个前男友一份深沉的爱。\r\n作弊器你用完了，我给了He。\r\nHe怎么折腾你，\r\n......未完不续。\r\n\r\n\r\n【备注】\r\n黄朝亮的电影《给19岁的我自己》，和阿琪的书《爱得起放得下》，都是感情治愈。\r\n读书，自己炼药自己服。\r\n看电影，别人嗑药你看疗效。\r\n怎么选，随你。",
            "useless_count": 0,
            "comments_count": 0,
            "alt": "https://movie.douban.com/review/9401614/",
            "id": "9401614",
            "subject_id": "26931155"
          },
          {
            "rating": {
              "max": 5,
              "value": 3,
              "min": 0
            },
            "useful_count": 0,
            "author": {
              "uid": "141438911",
              "avatar": "https://img3.doubanio.com/icon/u141438911-2.jpg",
              "signature": "",
              "alt": "https://www.douban.com/people/141438911/",
              "id": "141438911",
              "name": "蕉下鹿"
            },
            "created_at": "2018-05-28 16:19:17",
            "title": "简单谈谈我的感受",
            "updated_at": "2018-05-28 16:35:31",
            "share_url": "https://m.douban.com/movie/review/9399601",
            "summary": "这部新片在我们学校点映了，因为取景的缘故兴冲冲地跑去看。男女主很青春，剧情总体可以，尤其是过去未来当下的选择确实让我也想到自己，但还是不得不说，里面有些桥段真的败笔，比如男主偷看女生洗澡，男主穿梭...",
            "content": "这部新片在我们学校点映了，因为取景的缘故兴冲冲地跑去看。男女主很青春，剧情总体可以，尤其是过去未来当下的选择确实让我也想到自己，但还是不得不说，里面有些桥段真的败笔，比如男主偷看女生洗澡，男主穿梭在女生宿舍楼顶晾衣服的地方（可能我太古板了吧这要是换成我总会想到性骚扰）。还有女二李芊的设定更失败，没看出她哪里跟女主闺蜜了，而且人家男主没答应她她就跟人到处说男主是自己男朋友，后来跟女主闹翻还锁楼贴传单毁谤，还闹跳楼结果真的失足摔残了，什么年代还有这种滥俗人设存在，琼瑶剧都不会这么写啊。\r\n不过总体还是蛮有青春气息的吧。导演后来说他拍喜剧的，里面有些点是挺好笑的，整个放映厅就笑声最多了，尤其十九岁的女主收到二十九岁女主的纸条劝李芊不要跳楼，女主居然对李芊说“这个高度死不了人的”，我真的是笑出来了（算我笑点低）。好吧，观影还蛮愉快，比大陆那些打胎的要好一点，比那些年则差一点，我这么认为，就这样。\r\n抱歉了导演，知道你们在乎豆瓣评分，现场大家也给你鼓掌给你欢呼希望这部电影成功，但我还是只能给三星，不能再多了，三星给过去未来当下选择的梗，给片尾男二出现买下盒子的片段，给青春靓丽的男女主，扣掉的两星就是上面吐的槽吧，像我这种死板爱找茬的观影人真的很在乎人物塑造这种东西。",
            "useless_count": 0,
            "comments_count": 3,
            "alt": "https://movie.douban.com/review/9399601/",
            "id": "9399601",
            "subject_id": "26931155"
          },
          {
            "rating": {
              "max": 5,
              "value": 4,
              "min": 0
            },
            "useful_count": 1,
            "author": {
              "uid": "1086037",
              "avatar": "https://img3.doubanio.com/icon/u1086037-3.jpg",
              "signature": "血气方刚的妙龄少女",
              "alt": "https://www.douban.com/people/1086037/",
              "id": "1086037",
              "name": "懒懒牛"
            },
            "created_at": "2018-05-25 22:50:11",
            "title": "向前冲——没有泡过学长的19岁，不足以语青春（无剧透）",
            "updated_at": "2018-05-25 22:50:11",
            "share_url": "https://m.douban.com/movie/review/9393581",
            "summary": "前天夜里下楼，突然被广场上外放的音乐吸引。很诧异现在还有人听徐怀钰的《向前冲》 我能体会 好多姐妹为爱 傻傻的等待 偷偷掉眼泪 这样不对 耳朵过来交换意见 当王子被发现 我们向前冲吧！ 虽然这首歌已经被发廊...",
            "content": " 前天夜里下楼，突然被广场上外放的音乐吸引。很诧异现在还有人听徐怀钰的《向前冲》\r\n我能体会 好多姐妹为爱\r\n傻傻的等待 偷偷掉眼泪 \r\n这样不对 耳朵过来交换意见\r\n当王子被发现 我们向前冲吧！\r\n 虽然这首歌已经被发廊、中介和销售部毁了，但我还记得作为小女生的时候，听到这首歌的躁动。\r\n 女孩子，发现了喜欢的人，就去表白就去追啊！向前冲啊！\r\n 今天刚参加完阿德的豆瓣观影，提前看了这部片，脑海里又回想起这首歌。看来教导女孩子勇敢的面对自己的感情，主动积极的追求自己的所爱也是青春电影的永恒话题。\r\n 讲真，有一堆出国怀孕打胎的狗血青春片铺垫，对这部片也没啥期待。结果看下来倒是非常惊喜。先摆观点：一部及格以上，颇有惊喜的国产青春片，专治煽情狗血作死。不管你是在校还是毕业，和前任现任闺蜜还是一个人，都可以愉快的观影。如果你是个像我一样的中年少女，可能还会挂着蜜汁微笑——要是19岁的我泡到学长，然后脑子里全是马赛克。\r\n 演员里最有名的莫过于刚刚拿下金马奖的男主林柏宏，其他新人的表现虽然青涩，但总归没有用力过猛，看起来不会尴尬。人物ok的话，观众入戏就会很快，最直观的反映表现就是青春校园的笑点观众都get到了，影院时常会有笑声。\r\n 说起男主，导演在映后说，拍完川藏的镜头后，导演拾起马粪和男主林柏宏握手，林柏宏随即飞到台北拿下金马，再回到杭州继续拍戏。不由得感慨导演选角精准，现在的宣传重点全都在林柏宏身上。林柏宏的感觉像任贤齐那种非常绅士好脾气的人，笑起来桃花满满，身上亲和爽朗又有点撩人的气质成功塑造了一个痴心校草形象，在一众咆哮癫狂的神经质男主中鹤立鸡群，目测会收割一大波女粉。\r\n 女主几乎出现在98%的场次里，安妮说这是她第一次真正意义上的女主角。其实仔细看不难发现，男主只是一个对于女主来说非常重要的人，其实唯一的主角是女主，所以这部片可以归类为奇幻青春爱情片，但我认为青春爱情片只是宣传噱头，导演的立意是在女性个人成长，他最终想说的是，诚实的面对自己，勇敢的追求自己想要的。所以，林柏宏先生，如果因为这部片又获奖的话，你应该还是最佳男配哟。\r\n 从女性成长的立意来说，我个人喜欢女二多过女主，虽然也可以想象会有很多人diss她不够好看以及用力过猛，但是可能年纪大了，我认为导演并没有把女二标签化的塑造为一个站在女主对立面的坏人。她当然有一般意义上女二的心机、偏执和不择手段来制造戏剧冲突，但是相比于一脸寡淡隐忍的女主，她的主动和生动，写满了我想要我就要的脸是配得上校花的自尊心的。这世上有人晚熟就有人早熟，她们很早就很清楚自己要什么，毫不避讳，并为此争取。\r\n 如果你执意从道德角度来说，女主是鱼和熊掌都想要的白莲花圣母，女二是恃美而骄、以自我为中心的心机婊。可是代入到19岁的年纪，导演要塑造的只是一个情窦初开，有点自卑羞涩，在友情爱情中徘徊的乖乖女和一个早早的轻易拥有一切而不能忍受挫折和冷落的小公举啊！简单来说大概就是一个迟迟不敢站在聚光灯下想跑龙套的女主和一个从来都是女主第一次串场跑龙套愤而强行抢麦的女配吧。\r\n 还好这部片就是通过一个奇幻的方式在各归各位。冲突不再，两位女生当然就握手言和，发展成真正的友谊。\r\n 结尾算是个亮点，有点宿命论的意思（林同学更加坐实男配身份，心疼），更加说明了导演的用意，向前冲，就算结果不能改变，遵从内心就不会后悔。\r\n 果然人只会为没做过的事后悔啊。\r\n 逻辑的顺畅程度上，本片的硬伤也很明显。如果是我的话，会让人物关系更加立体，让关键场景的台词更加有说服力或者感染力，写出《call me by your name》爸爸说的那种经典台词吧。\r\n 但是总的来说，我认可主创团队的诚意，剧本的情节设计是贴近生活有真实感的，立意上也比一般国产青春电影高出不少，所以值得去电影院支持。\r\n 最后！杭州的钱江新城航拍尽显锐意豪气。没有西湖的杭州也是个文艺美好的城市啊啊啊！",
            "useless_count": 1,
            "comments_count": 0,
            "alt": "https://movie.douban.com/review/9393581/",
            "id": "9393581",
            "subject_id": "26931155"
          },
          {
            "rating": {
              "max": 5,
              "value": 4,
              "min": 0
            },
            "useful_count": 1,
            "author": {
              "uid": "78635347",
              "avatar": "https://img3.doubanio.com/icon/u78635347-5.jpg",
              "signature": "",
              "alt": "https://www.douban.com/people/78635347/",
              "id": "78635347",
              "name": "ls"
            },
            "created_at": "2018-05-25 20:38:53",
            "title": "大陆的台式青春片",
            "updated_at": "2018-05-29 17:08:15",
            "share_url": "https://m.douban.com/movie/review/9393257",
            "summary": "我觉得作为青春片，让人感觉到触动，基本上这部电影就及格了。 这部电影应该让很多人触动吧，毕竟青春里面基本都有一个喜欢到不敢追的人，或者说最后阴差阳错错过的人。 但这部电影里面混杂了很多我所厌恶的大陆...",
            "content": "我觉得作为青春片，让人感觉到触动，基本上这部电影就及格了。\r\n这部电影应该让很多人触动吧，毕竟青春里面基本都有一个喜欢到不敢追的人，或者说最后阴差阳错错过的人。\r\n但这部电影里面混杂了很多我所厌恶的大陆青春片情节，我不是反对大学生生活里面有荤段子，有是正常的，但不要拍得恶俗，我觉得里面很多段拍得非常恶俗。\r\n台湾青春片该有的都有吧，林柏宏杂货架那一段还是很有感觉的。\r\n校花装扮的太丑了，我不是针对演员，我看豆瓣条目还行，不知道怎么化的妆。\r\n这片子让我有点想回看情书和求婚大作战",
            "useless_count": 1,
            "comments_count": 1,
            "alt": "https://movie.douban.com/review/9393257/",
            "id": "9393257",
            "subject_id": "26931155"
          },
          {
            "rating": {
              "max": 5,
              "value": 5,
              "min": 0
            },
            "useful_count": 0,
            "author": {
              "uid": "156311430",
              "avatar": "https://img3.doubanio.com/icon/u156311430-3.jpg",
              "signature": "",
              "alt": "https://www.douban.com/people/156311430/",
              "id": "156311430",
              "name": "琪琪"
            },
            "created_at": "2018-05-29 12:49:05",
            "title": "无悔的十九岁",
            "updated_at": "2018-05-29 12:49:05",
            "share_url": "https://m.douban.com/movie/review/9401320",
            "summary": "爱情里最遗憾的事，不是没遇到爱的人，而是遇到却最终错过。《给19岁的我自己》所讲的就是一个如何弥补错过爱情的故事。这个国产青春纯爱片是如此特别，不是深挖套路的鸡汤式电影，没有什么烂俗的狗血情节。只是...",
            "content": "爱情里最遗憾的事，不是没遇到爱的人，而是遇到却最终错过。《给19岁的我自己》所讲的就是一个如何弥补错过爱情的故事。这个国产青春纯爱片是如此特别，不是深挖套路的鸡汤式电影，没有什么烂俗的狗血情节。只是用女主阳艺雪在19岁时错过爱，29岁时寻回爱的前后过程，来勾起观者的青春记忆，治愈过往青春中曾经遗憾的失落。\n\n\n因为导演是台湾人的缘故，影片虽属内地制造，却不可避免地带有台式青春片清新、淡雅、唯美的美学风格。片名未现之前的序幕长达十几分钟。旅游摄影师莫晓枫步行茶马古道，白领阳艺雪在都市乘坐地铁下班。俯拍镜头体现男主孤独的的跋山涉水，近景特写显露女主孤寂苦涩的生活。这些暗示有情人未在一起的遗憾。因莫晓枫在冒险中意外去世，阳艺雪在葬礼上得到他留给自己的遗物，满满一木盒的写满对她思念的信件，将其思绪带回到十年前的大学时光，一段些许奇幻色彩、饱含真情的爱情故事由此拉开帷幕。\n\n\n纯粹清澈的画面简单勾勒出了一段盛夏的青春，清新风格更是如此契合着美好年华的纯涩。几个男生因故住进女生宿舍。摄影系阳光帅气男遭遇历史系快乐俏皮女。学长莫晓枫大胆追求学妹，对阳艺雪玩起花式撩妹；阳艺雪明明暗恋学长，却因同寝校花王芊对莫晓枫情有独钟，却始终爱其在心口不开。为了友情而放弃了爱情。可她的一心谦让，换来的竟是三个人在情感上的很受伤。\n\n\n“如果我当时勇敢，回忆是不是也可以改变。”十年之后，阳艺雪因错过爱情而后悔。她突然发现莫晓枫留给自己的木盒有神奇的穿越功能，可与过去时空连接，于是29岁的阳艺雪试图挽回错过的爱人。她根据日记里记录下与莫晓枫相处的时时刻刻，如同奔跑的罗拉一样，不停地跑到两人曾经待过的场所，通过不断地与19岁的自己鸿雁传书，来欲追回错失的爱。画面随着女主的视角在过去与现在两者间游走。往昔的大学生活是如此美好、单纯，如今的都市生活则是如此忙碌、痛苦。两者形成鲜明的对照。\n\n",
            "useless_count": 2,
            "comments_count": 0,
            "alt": "https://movie.douban.com/review/9401320/",
            "id": "9401320",
            "subject_id": "26931155"
          },
          {
            "rating": {
              "max": 5,
              "value": 4,
              "min": 0
            },
            "useful_count": 7,
            "author": {
              "uid": "150930379",
              "avatar": "https://img3.doubanio.com/icon/u150930379-2.jpg",
              "signature": "",
              "alt": "https://www.douban.com/people/150930379/",
              "id": "150930379",
              "name": "许凡若曦"
            },
            "created_at": "2018-05-29 12:01:54",
            "title": "19岁的爱情",
            "updated_at": "2018-05-29 12:01:54",
            "share_url": "https://m.douban.com/movie/review/9401266",
            "summary": "电影中帅气学长为爱勇敢表白，满满的都是套路：壁咚。片中多次出现壁咚，面对面最短的距离，眼神的交流，想想就觉得小鹿乱撞呢！ 作为摄影系的学长，泡妹最好的方法就是给妹子拍照，片中男主与女主一见钟情，从此...",
            "content": "电影中帅气学长为爱勇敢表白，满满的都是套路：壁咚。片中多次出现壁咚，面对面最短的距离，眼神的交流，想想就觉得小鹿乱撞呢！\r\n作为摄影系的学长，泡妹最好的方法就是给妹子拍照，片中男主与女主一见钟情，从此在偷拍的道路上不可自拔，直到“偶然”入住女生寝室，接近女主角，开始甜蜜的追爱过程，看到片中男主为女主办的摄影展，每一张照片都是自己，全是生活的点滴，更是充满了爱。光是看着这样的情节，都分分钟被感动哭。\r\n片中还有经典片段，麦当劳表白，情侣新地第二杯半价，用一杯半价的新地就可以把妹子变成自己的女朋友，真是心机和暖暖的。",
            "useless_count": 2,
            "comments_count": 0,
            "alt": "https://movie.douban.com/review/9401266/",
            "id": "9401266",
            "subject_id": "26931155"
          },
          {
            "rating": {
              "max": 5,
              "value": 4,
              "min": 0
            },
            "useful_count": 0,
            "author": {
              "uid": "179059223",
              "avatar": "https://img3.doubanio.com/icon/u179059223-1.jpg",
              "signature": "",
              "alt": "https://www.douban.com/people/179059223/",
              "id": "179059223",
              "name": "荆轲166"
            },
            "created_at": "2018-05-29 10:13:18",
            "title": "真正的青春，更多是遗憾",
            "updated_at": "2018-05-29 10:13:18",
            "share_url": "https://m.douban.com/movie/review/9401068",
            "summary": "爱情里最遗憾的事，不是没遇到爱的人，而是遇到却最终错过。《给19岁的我自己》所讲的就是一个如何弥补错过爱情的故事。这个国产青春纯爱片是如此特别，不是深挖套路的鸡汤式电影，没有什么烂俗的狗血情节。只是...",
            "content": "\r\n 爱情里最遗憾的事，不是没遇到爱的人，而是遇到却最终错过。《给19岁的我自己》所讲的就是一个如何弥补错过爱情的故事。这个国产青春纯爱片是如此特别，不是深挖套路的鸡汤式电影，没有什么烂俗的狗血情节。只是用女主阳艺雪在19岁时错过爱，29岁时寻回爱的前后过程，来勾起观者的青春记忆，治愈过往青春中曾经遗憾的失落。\r\n因为导演是台湾人的缘故，影片虽属内地制造，却不可避免地带有台式青春片清新、淡雅、唯美的美学风格。片名未现之前的序幕长达十几分钟。旅游摄影师莫晓枫步行茶马古道，白领阳艺雪在都市乘坐地铁下班。俯拍镜头体现男主孤独的的跋山涉水，近景特写显露女主孤寂苦涩的生活。这些暗示有情人未在一起的遗憾。因莫晓枫在冒险中意外去世，阳艺雪在葬礼上得到他留给自己的遗物，满满一木盒的写满对她思念的信件，将其思绪带回到十年前的大学时光，一段些许奇幻色彩、饱含真情的爱情故事由此拉开帷幕。\r\n纯粹清澈的画面简单勾勒出了一段盛夏的青春，清新风格更是如此契合着美好年华的纯涩。几个男生因故住进女生宿舍。摄影系阳光帅气男遭遇历史系快乐俏皮女。学长莫晓枫大胆追求学妹，对阳艺雪玩起花式撩妹；阳艺雪明明暗恋学长，却因同寝校花王芊对莫晓枫情有独钟，却始终爱其在心口不开。为了友情而放弃了爱情。可她的一心谦让，换来的竟是三个人在情感上的很受伤。\r\n“如果我当时勇敢，回忆是不是也可以改变。”十年之后，阳艺雪因错过爱情而后悔。她突然发现莫晓枫留给自己的木盒有神奇的穿越功能，可与过去时空连接，于是29岁的阳艺雪试图挽回错过的爱人。她根据日记里记录下与莫晓枫相处的时时刻刻，如同奔跑的罗拉一样，不停地跑到两人曾经待过的场所，通过不断地与19岁的自己鸿雁传书，来欲追回错失的爱。画面随着女主的视角在过去与现在两者间游走。往昔的大学生活是如此美好、单纯，如今的都市生活则是如此忙碌、痛苦。两者形成鲜明的对照。\r\n片中戳点台词和养眼画面互补叠加，流畅亲切，易于消化。故事虽有怀旧色彩，但绝不是古早味的清汤寡水，而是让你从舌尖烧到胃袋的高粱酒，怎么high怎么来。而且在展现浪漫的小美好上极其细腻，搞笑内容则用料很猛。那所谓的“信件穿越”，只是回忆的透镜而已，将过去的时光投射到今时的天花板上。叫人见到大学时代的青涩之爱。莫晓枫与阳艺雪的相处点滴，不仅有着很多诙谐幽默的笑料，还有不少情意浓浓的浪漫细节，直线击中了最率真矜持的纯情。女主的挽爱行动，无法让男主最终摆脱死亡的命运，但爱情的遗憾却得到了弥补，这让结局充满了暖意。\r\n其实，阳艺雪弥补错过的爱情过程，只不过是折射她心中美好的愿望罢了，变相地显示此情可待成追忆。对于逝去的青春，不管你若无悔还是无悔，我们除了感谢经过的事、遇到的人，还能多说些什么。有多少爱可以重来，有多少人值得等待。爱情对于很多人来说，就是这样一道循环往复的符咒而已。\r\n ",
            "useless_count": 2,
            "comments_count": 0,
            "alt": "https://movie.douban.com/review/9401068/",
            "id": "9401068",
            "subject_id": "26931155"
          },
          {
            "rating": {
              "max": 5,
              "value": 5,
              "min": 0
            },
            "useful_count": 0,
            "author": {
              "uid": "156929780",
              "avatar": "https://img3.doubanio.com/icon/u156929780-5.jpg",
              "signature": "",
              "alt": "https://www.douban.com/people/156929780/",
              "id": "156929780",
              "name": "鹿鸣悠悠"
            },
            "created_at": "2018-05-27 00:00:57",
            "title": "愿永远有19岁的勇气与青春！",
            "updated_at": "2018-05-27 00:00:57",
            "share_url": "https://m.douban.com/movie/review/9395924",
            "summary": "在大美浙师取景的#给19岁的我自己#，台湾知名导演黄朝亮作品，男主角获得过“第53届台湾电影金马奖”最佳男配角奖，一部借助时空穿梭书信方式的奇幻爱情电影。点映加导演，主演的现场分享，正如导演所说，这部电...",
            "content": "在大美浙师取景的#给19岁的我自己#，台湾知名导演黄朝亮作品，男主角获得过“第53届台湾电影金马奖”最佳男配角奖，一部借助时空穿梭书信方式的奇幻爱情电影。点映加导演，主演的现场分享，正如导演所说，这部电影不仅仅是给19岁的人看的，而是所有人都能够从中找到年轻时的勇气。时空穿越虽然是故事的主要呈现方式，但更是要通过这种方式告诫听众一定要珍惜当下，勇敢地去追求自己想要实现的目标。影片中的红楼，黄楼，邵逸夫图书馆，夜幕下的油菜花地，排球场，更加体现浙师独特的美！5月29号全国上映，不容错过！🎬\r\n",
            "useless_count": 2,
            "comments_count": 0,
            "alt": "https://movie.douban.com/review/9395924/",
            "id": "9395924",
            "subject_id": "26931155"
          },
          {
            "rating": {
              "max": 5,
              "value": 4,
              "min": 0
            },
            "useful_count": 1,
            "author": {
              "uid": "81767054",
              "avatar": "https://img3.doubanio.com/icon/u81767054-2.jpg",
              "signature": "",
              "alt": "https://www.douban.com/people/81767054/",
              "id": "81767054",
              "name": "梦菲MV"
            },
            "created_at": "2018-05-26 16:38:02",
            "title": "《给19岁的我自己》影评：不好好学习没关系，泡学长才是正经事",
            "updated_at": "2018-05-26 16:38:02",
            "share_url": "https://m.douban.com/movie/review/9394900",
            "summary": "“不好好学习没关系，泡学长才是正经事”，这是电影《给19岁的我自己》中出现频率最高的一句台词，也是给我印象最为深刻的一句话。 当这句话被女主阳艺雪（石安妮饰）在信中不断地提及时，我就在想究竟是什么样的...",
            "content": "\r\n“不好好学习没关系，泡学长才是正经事”，这是电影《给19岁的我自己》中出现频率最高的一句台词，也是给我印象最为深刻的一句话。\r\n当这句话被女主阳艺雪（石安妮饰）在信中不断地提及时，我就在想究竟是什么样的遗憾让导演黄朝亮在时隔多年之后，勇敢地说出这句有悖常理的话的，因为这句话于我而言就像是对错过的爱情的一种祭奠。\r\n曾经的我们被灌输的思想是学生时代不要谈恋爱，好好学习才是正经事，好好学习才能拥有美好的未来，可如果这个美好的未来是要以牺牲爱情为代价，要用失去一生的幸福来换取的话，我宁愿不要，因为现在的我终于在为时已晚的悔恨中意识到，人这一生真正遇见爱情的次数真的非常有限。\r\n随着年龄的增长，随着阅历的增加，我们愿意相信的东西越来越少，我们的生活圈子越来越小，我们遇见真爱的几率几乎为零，那个青春年少时让你怦然心动的人，如今却成了你心中的一根刺，每每想起都会隐隐作痛。\r\n这世上的所有东西都可以等，都可以让，唯有亲情等不得，唯有爱情让不了。\r\n如果说阳艺雪的爱情是输给了友情的话，我们大多数人的爱情则是输给了面子，输给了自尊心，有些甚至还没开始就已经宣告结束。\r\n如果给你一个回到19岁的机会，你还会为了友情，为了面子，再次失去爱情吗？\r\n这部由黄朝亮执导，林柏宏、石安妮、王芊领衔主演，何明翰、苑琼丹友情出演，汇集了两岸三地，一众演技精湛的演员的青春奇幻爱情电影《给19岁的我自己》讲的就是这样一个关于迷茫与选择，一个绵延10年又穿越了10年的爱情故事。29岁的阳艺雪通过给19岁的自己写信，试图挽回错过的爱人，弥补青春的遗憾。\r\n当我们还在为错过而遗憾，当我们还沉浸在《后来的我们》那无果而终的爱情的伤感中时，《给19岁的我自己》却选择了让爱情重新来过，用一种超现实的方式向我们阐述了积极的爱情观，面对没有如果的现实生活，喜欢就表白，爱了就不后悔。而“不好好学习没关系，泡学长才是正经事”、“喜欢他就要和他在一起，什么往事匆匆，此情追忆，都是狗屁”、“老天或许注定了结局，但生命的过程中，我们永远有权选择过得精彩”等等台词金句更是引起了观众对青春、对爱情的深刻共鸣。\r\n十年心存一念，爱你穿越时空，在这场跨越十年的爱情故事中，我相信每个人都能从中找到自己的青春影子。\r\n5月29日，让我们一起开启“给19岁的我自己”的“时光宝盒”，在来往信笺中，在“拾光之旅”中，为自己的爱情、为自己的青春，画上一个完美的句号。\r\n",
            "useless_count": 2,
            "comments_count": 0,
            "alt": "https://movie.douban.com/review/9394900/",
            "id": "9394900",
            "subject_id": "26931155"
          }
        ],
        "start": 0,
        "total": 31,
        "next_start": 20,
        "subject": {
          "rating": {
            "max": 10,
            "average": 0,
            "details": {
              "1": 0,
              "2": 0,
              "3": 0,
              "4": 0,
              "5": 0
            },
            "stars": "00",
            "min": 0
          },
          "genres": [
            "剧情",
            "爱情"
          ],
          "title": "给19岁的我自己",
          "casts": [
            {
              "avatars": {
                "small": "https://img3.doubanio.com/view/celebrity/s_ratio_celebrity/public/p1425307712.95.webp",
                "large": "https://img3.doubanio.com/view/celebrity/s_ratio_celebrity/public/p1425307712.95.webp",
                "medium": "https://img3.doubanio.com/view/celebrity/s_ratio_celebrity/public/p1425307712.95.webp"
              },
              "name_en": "Austin Lin",
              "name": "林柏宏",
              "alt": "https://movie.douban.com/celebrity/1275324/",
              "id": "1275324"
            },
            {
              "avatars": {
                "small": "https://img1.doubanio.com/view/celebrity/s_ratio_celebrity/public/p1525936494.88.webp",
                "large": "https://img1.doubanio.com/view/celebrity/s_ratio_celebrity/public/p1525936494.88.webp",
                "medium": "https://img1.doubanio.com/view/celebrity/s_ratio_celebrity/public/p1525936494.88.webp"
              },
              "name_en": "Anni Shi",
              "name": "石安妮",
              "alt": "https://movie.douban.com/celebrity/1346306/",
              "id": "1346306"
            },
            {
              "avatars": {
                "small": "https://img3.doubanio.com/view/celebrity/s_ratio_celebrity/public/p1525664797.31.webp",
                "large": "https://img3.doubanio.com/view/celebrity/s_ratio_celebrity/public/p1525664797.31.webp",
                "medium": "https://img3.doubanio.com/view/celebrity/s_ratio_celebrity/public/p1525664797.31.webp"
              },
              "name_en": "Qian Wang",
              "name": "王芊",
              "alt": "https://movie.douban.com/celebrity/1392325/",
              "id": "1392325"
            }
          ],
          "durations": [
            "98分钟"
          ],
          "collect_count": 294,
          "mainland_pubdate": "2018-05-29",
          "has_video": false,
          "original_title": "给19岁的我自己",
          "subtype": "movie",
          "directors": [
            {
              "avatars": {
                "small": "https://img3.doubanio.com/view/celebrity/s_ratio_celebrity/public/p1495007099.03.webp",
                "large": "https://img3.doubanio.com/view/celebrity/s_ratio_celebrity/public/p1495007099.03.webp",
                "medium": "https://img3.doubanio.com/view/celebrity/s_ratio_celebrity/public/p1495007099.03.webp"
              },
              "name_en": "Chao-liang Huang",
              "name": "黄朝亮",
              "alt": "https://movie.douban.com/celebrity/1336729/",
              "id": "1336729"
            }
          ],
          "pubdates": [
            "2018-05-29(中国大陆)"
          ],
          "year": "2018",
          "images": {
            "small": "https://img3.doubanio.com/view/photo/s_ratio_poster/public/p2521030550.webp",
            "large": "https://img3.doubanio.com/view/photo/s_ratio_poster/public/p2521030550.webp",
            "medium": "https://img3.doubanio.com/view/photo/s_ratio_poster/public/p2521030550.webp"
          },
          "alt": "https://movie.douban.com/subject/26931155/",
          "id": "26931155"
        }
      }
      this.id = this.$root.$mp.query.id
      this.genres = data.subject.genres
      let result = data.reviews[0]
      this.review = {
        avatar: result.author.avatar,
        userName: result.author.name,
        created_at: result.created_at,
        title: result.title,
        content: result.content
      }
      console.log('this.review', this.review)
      console.log('review.author.avatar', this.review.author.avatar)
    },
    methods: {
      clickHeart(){
        this.collected = !this.collected
      }
    },
    computed: {
      heartUrl(){
        if (this.collected) {
          return HEART_URL
        } else {
          return HOLLOW_HEART_URL
        }
      }
    },
    components: {
      EndFooter
    }
  }
</script>

<style lang="less" scoped rel="stylesheet/less">
  .review-detail {
    position: relative;
    padding: 10px 20px 0 20px;
    .genres-wrapper {
      width: 100%;
      height: 30px;
      overflow: hidden;
      .genre {
        margin-top: 2px;
        padding: 2px 4px;
        display: inline-block;
        margin-right: 10px;
        height: 20px;
        min-width: 35px;
        line-height: 20px;
        text-align: center;
        font-size: 12px;
        color: #25B423;
        border-radius: 10px;
        border: 1px solid #25B423;
      }
    }
    .title-wrapper {
      margin-top: 16px;
      .title {
        position: relative;
        font-weight: 600;
        font-size: 16px;
        line-height: 18px;
      }
    }
    .user-wrapper {
      display: flex;
      height: 70px;
      width: 100%;
      align-items: center;
      .user-avatar {
        flex: 0 0 36px;
        width: 36px;
        height: 36px;
        border-radius: 50%;
      }
      .user-content {
        margin-left: 6px;
        flex: 1 1 auto;
        display: flex;
        flex-direction: column;
        justify-content: center;
        .user-name {
          font-size: 14px;
          height: 18px;
          line-height: 18px;
        }
        .review-time {
          font-size: 12px;
          color: #999;
          height: 16px;
          line-height: 16px;
        }
      }
      .thumb-up {
        flex: 0 0 32px;
        height: 32px;
        .heart {
          width: 32px;
          height: 32px;
        }
      }
    }
    .content-wrapper {
      margin-top: 10px;
      .review-content {
        font-size: 14px;
        line-height: 20px;
        text-indent: 2em;
        color: #353535;
      }
    }
    .footer-wrapper {
      margin-top: 30px;
      width: 100%;
    }
  }

</style>
